CONDITIONS = {
    1 => 'Даны два действительных числа a и b. Получить их сумму, разность и произведение.',
    2 => 'Даны действительные числа x и y. Получить (|x| -|y|)/(1 + xy) ',
    3 => 'Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.',
    6 => 'Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь.',
    8 => 'Определить периметр правильного n-угольника, описанного около окружности радиуса r.',
    9 => 'Три сопротивления R1, R2, R3 соединены параллельно. Найти сопротивление соединения.',
    10 => 'Определить время падения камня на поверхность земли с высоты h.',
    12 => 'Дана сторона равностороннего треугольника. Найти площадь этого треугольника.',
    13 => 'Вычислить период колебания маятника длины l.',
    15 => 'Даны гипотенуза и катет прямоугольного треугольника. Найти второй катет и радиус
вписанной окружности.',
    16 => 'Известна длина окружности. Найти площадь круга, ограниченного этой окружностью.',
    24 => 'Вычислить расстояние между двумя точками с координатами x1,y1 и x2,y2.',
    30 => 'Дано действительное число х. Не пользуясь никакими другими арифметическими операциями,
кроме умножения, сложения и вычитания, вычислить: 1−2x +3x^2 −4x^3 и 1+2x +3x^2 +4x^3.
Разрешается использовать не более восьми операций.',
    33 => 'Даны действительные числа х, у. Получить: max (x, y), min (x, y).',
    34 => 'Даны действительные числа x, y, z. Получить: min (x, y, z), max(x, y, z).',
    39 => 'Даны два действительных числа. Вывести первое число, если оно больше второго, и оба числа, если это не так.',
    41 => 'Даны три действительных числа. Выбрать из них те, которые принадлежат интервалу (1, 3).',
    43 => 'Даны три действительных числа. Возвести в квадрат те из них, значения которых неотрицательны.',
    62 => 'Определить, является ли данное целое число четным.',
    64 => 'Дано натуральное число n (n > 99). Определить число сотен в нем.',
    65 => 'Дано натуральное число n (n>99). Выяснить, верно ли, что n^2 равно кубу суммы цифр числа n.',
    67 => 'Дано натуральное число n (n ≤ 100):
          а) Сколько цифр в числе n?
          б) Чему равна сумма его цифр?
          в) Найти последнюю цифру числа n.
          г) Найти первую цифру числа n.
          д) В предположении, что n ≥ 10, найти предпоследнюю цифру числа n.',
    182 => 'Дано натуральное число n.В массиве a1, …, an найти количество и сумму тех членов
данной последовательности, которые делятся на 5 и не делятся на 7.',
    185 => 'Дано натуральное число n. Получить удвоенную сумму всех положительных членов последовательности a1, …, an.',
    191 => 'Дано натуральное число n. Заменить все большие семи члены последовательности a1, …, an числом 7.
Вычислить количество таких членов.',
    205 => 'Дано натуральное число n. Получить max(a1, …, an) и sqrt(a1^2 + ... +an^2).',
    207 => 'Дано натуральное число n. Выбросить из записи числа n цифры 0 и 5,
оставив прежним порядок остальных цифр. Например, из числа 59015509 должно получиться 919.',
    224 => 'Дано натуральное число n. Получить все его натуральные делители.',
    225 => 'Дано натуральное число n. Получить все такие натуральные q, что n делится на q^2 и не делится на q^3.',
    230 => 'Дано натуральное число n. Найти длину наименьшего отрезка числовой оси, содержащего числа
a1, …, an.',
    272 => 'Даны действительные числа а1901, a1902, …,аn – количество осадков (в миллиметрах),
выпавших в Москве в течение первых n лет нашего столетия.
Надо вычислить среднее количество осадков и отклонение от среднего для каждого года.',
    279 => 'Дано действительные числа n. Вычислить для  a1, …, an, b1, …, bn:
(a1+bn)(a2+bn-1)...(an+b1).',
    302 => 'Дано натуральное число n. Сколько различных цифр встречается в его десятичной записи?',
    317 => 'Дано натуральное число n, для  a1, …, a10 вычислить a1 + a2^2 + ... + a10^10',
    325 => 'Дано натуральное число n. Получить все простые делители этого числа.',
    328 => 'Найти 100 первых простых чисел.',
    536 => 'Дано натуральное число n. Выяснить, имеются ли среди чисел a1, ..., an совпадающие.',
    555 => 'Дано натуральное n. Получить первые n строк треугольника Паскаля.
Треугольником Паскаля называется числовой треугольник в котором по краям стоят единицы,
а каждое число внутри равно сумме двух стоящих над ним в ближайшей строке сверху.',
    561 => 'Дано натуральное число n. Среди чисел 1, ..., n найти все такие,
запись которых совпадает с последними цифрами записи их квадрата (как, например, 6^2 = 36, 25^2 = 625 и т. д.).',
    606 => 'Даны действительные положительные числа a, b, c, d.
Выяснить, можно ли построить четырехугольник с такими длинами сторон.',
    697 => 'Для матриц А и В размера k × m и m × l соответственно найти произведение АВ.',
    698 => 'Для квадратной матрицы прядка n. Получить матрицуА^2.',
    699 => 'Для квадратных матриц А и В порядка n. Получить матрицу АВ–ВА.',
    704 => 'Для квадратных матриц A, B и C порядка n. Получить матрицу (A+B)C.',
    710 => 'Для матрицы А размера m × n. Получить транспонированную матрицу А* (ее размер – m × n ).',
    822 => 'Дан номер года. Указать число дней в этом году.',
    823 => 'Даны натуральные числа n, m (n ≤ m ).
Определить, сколько из чисел n, n+1, ..., m являются номерами високосных годов.',
    831 => 'День учителя ежегодно отмечается в первое воскресенье октября. Дано натуральное число n, означающее номер года.
Определить число, на которое в октябре указанного года приходится День учителя.',
    986 => '«Угадай число». Программа с помощью датчика случайных чисел выбирает число в диапазоне от 0 до 9.
Попробуйте угадать это числ.',
    988 => '«Ипподром». Играющий выбирает одну из трех лошадей, состязающихся на бегах, и выигрывает,
если его лошадь приходит первой. Скорость передвижения лошадей на разных этапах выбирается программой
с помощью датчика случайных чисел.
Введите номер лошади: 1 => Watercolor, 2 => Alpha, 3 => Gallop',
    1009 => '«100 спичек». Из кучки, первоначально содержащей 100 спичек, двое играющих поочередно берут
по несколько спичек: не менее одной и не более десяти. Проигрывает взявший последнюю спичку.'
}